---
kind: property
id: P:Autodesk.Revit.DB.TriangleInShellComponent.VertexIndex2
source: html/7e2c0ef0-4882-c04b-53ec-f2d822bf8456.htm
---
# Autodesk.Revit.DB.TriangleInShellComponent.VertexIndex2 Property

Index of the triangle's third vertex in the TriangulatedShellComponent's array of vertices.

## Syntax (C#)
```csharp
public int VertexIndex2 { get; }
```